OpenFOAMfiles/run/streetcanyon_perpendicular/LoD2/LAD06/conifer/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue plantCd 0
    volScalarFieldValue leafAreaDensity 0
);

regions
(
    cellToCell
    {
    	set porousCells;
        fieldValues
        (
            volScalarFieldValue plantCd 0.2
            volScalarFieldValue leafAreaDensity 0.6
        );
    }

);


